app/controllers/school_classes_controller.rb

	def create
	  @school_class = SchoolClass.new(student_params(:title, :room_number))
	  @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-08-10 13:29:52.073525"], ["updated_at", "2019-08-10 13:29:52.073525"]]

	def update
	  @school_class = SchoolClass.find(params[:id])
	  @school_class.update(school_class_params(:title))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["updated_at", "2019-08-10 13:28:52.303477"], ["id", 1]]