app/controllers/students_controller.rb

	def create
	  @student = Student.new(student_params(:title, :description))
	  @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-08-10 13:24:02.999236"], ["updated_at", "2019-08-10 13:24:02.999236"]]

	def update
	  @student = Student.find(params[:id])
	  @student.update(student_params(:title))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["updated_at", "2019-08-10 13:24:03.511086"], ["id", 1]]